[
  {
    "period": "Mai 2023 - October 2023",
    "location": "RBK, Tunis",
    "position": "Full-Stack Javascript Developper",
    "description": "- Collaborate with a 5 persons team of Developers to create fully functional and optimized full-stack applications using varying technologies.\n- Present a variety of applications to peers and mentors.\n- Led team as scrum master through a full-stack project."
  },
  {
    "period": "January 2019 - March 2023",
    "location": "Vistaprint, Tunis",
    "position": "Motion Graphic Designer",
    "description": "- Collaborate with the Marketing and creative team to create animated assets for various viewing experiences (Stadium banners/Urbain Displays/Social Media...).\n- Prepare rough drafts and present ideas to shareholders.\n- Plan and organize project design choices on Figma for review.\n- Prepare dynamic files for  integration into the Celtra Platform.\n- Package source materials for hand-off to the production team.\n- Edit music and visuals to create an engaging experience.\n- Established a clear and efficient work pipeline for animation projects."
  },
  {
    "period": "December 2016 - January 2019",
    "location": "Vistaprint, Tunis",
    "position": "Production Designer",
    "description": "- Making sure that the site assets are consistent and straightforward.\n- Liaising with the localization and the site operations teams to meet deadlines.\n- Partnering with the creative and online merchandising teams to define the design requirements in order to execute on the concept and meet the project goals.\n- Localizing the site assets and making sure that every locale and language on the site shows a harmonious design and a clear messaging."
  },
  {
    "period": "June 2011 - March 2016",
    "location": "Kanaseed, Tunis",
    "position": "Media Creator/Mentor",
    "description": "- Created a full photo/video coverage for multiple musical events.\n- Created a full pitch video presentation for possible client (Ooredoo).\n- Mini-series filming editing and mixing for the agency.\n- Trained interns in video shooting and editing.\n- Trained fellow co-workers in DSLR Photography & the essential principles of photography."
  }
]
